{
  "title": "01 Introduction",
  "content": "# Introduction & Overview\n\n**SWDCK** (SwiftDiscKit) is a high-performance, modern Discord bot framework written entirely in Swift. It leverages Swift's powerful concurrency model (`async/await`) to provide a seamless and efficient developer experience for building everything from simple notification bots to complex, interactive community tools.\n\nBuilt from the ground up to be lightweight yet feature-rich, SWDCK handles the complexities of the Discord Gateway and REST API, allowing you to focus on your bot's unique logic.\n\n## Why use SWDCK?\n\nCompared to other Discord libraries in the Swift ecosystem, SWDCK prioritizes:\n\n- **Modern Swift Concurrency**: Fully built on `async/await` and `Actors`, ensuring thread safety and readable asynchronous code.\n- **Type Safety**: Comprehensive models for Discord entities (Messages, Interactions, Guilds, etc.) reduce runtime errors.\n- **Developer Productivity**: A clean, intuitive API that feels \"Swifty\" and follows modern best practices.\n- **Rich Interaction Support**: First-class support for Slash Commands and the powerful \"Components V2\" system.\n\n## Feature Highlights\n\n| Feature | Description |\n|---------|-------------|\n| **Gateway Support** | Automatic connection management, heartbeat, and reconnection logic. |\n| **Slash Commands** | Easy registration and handling of global and guild-scoped commands. |\n| **Event System** | Type-safe closures for handling messages, member updates, and more. |\n| **Components V2** | Support for modern UI elements like buttons, select menus, and modals. |\n| **Rich Embeds** | A flexible builder for creating beautiful, formatted messages. |\n| **Full API Mapping** | Access to almost every Discord REST endpoint via a clean interface. |\n\n## Requirements\n\nTo build and run a bot with SWDCK, you'll need:\n\n- **Swift Version**: 5.9 or higher\n- **Platform**: macOS 14.0+ or iOS 17.0+\n- **Discord API**: v10 (handled automatically by the library)\n\n---\n\n## Documentation Map\n\n- [Installation](./installation) — Get set up and connected.\n- [Quick Start](./quick-start) — Your first \"Hello World\" bot.\n- [Core Concepts](./core-concepts) — Understanding the SWDCK mental model.\n- [Event System](./event-system) — Listen and react to Discord events.\n- [Messages](./messages) — Reading and sending messages.\n- [Embeds](./embeds) — Creating rich, formatted content.\n- [Slash Commands](./slash-commands) — Modern interactions.\n- [Components](./components) — Buttons, Selects, and Modals.\n- [API Reference](./api-reference) — Exhaustive technical documentation.\n\n> **Next:** [Installation](./installation)\n"
}