{
  "title": "04 Core Concepts",
  "content": "# Core Concepts\n\nBefore building complex features, it's important to understand the mental model behind SWDCK and how it interacts with Discord.\n\n## The `DiscordBot` Object\n\nThe `DiscordBot` class is the central hub of your application. It manages the connection to Discord, handles incoming events, and providing access to the REST API. You typically create one instance of this class and use it throughout your bot's lifecycle.\n\n```swift\nlet bot = DiscordBot(token: \"...\", intents: .default)\n```\n\n## Token\n\nA **Bot Token** is essentially your bot's password. SWDCK uses it to authenticate every request made to Discord. \n> ⚠️ **Warning:** Never hardcode your token in public repositories. Use environment variables or a configuration file instead.\n\n## Intents\n\n**Intents** are a way for your bot to tell Discord exactly which events it wants to receive. This reduces bandwidth and improves performance.\n- `.default`: Includes common events like guild joins, channel updates, etc.\n- `.messageContent`: Required to read the `content` of messages.\n- `.guildMembers`: Required to receive member-related events (privileged).\n\n```swift\n// Example: Subscribing to default events + message content\nlet intents = GatewayIntents.default | .messageContent\n```\n\n## Gateway\n\nThe **Gateway** is a long-lived WebSocket connection that Discord uses to send real-time events to your bot. SWDCK manages this connection for you, including:\n- **Handshaking**: Identifying your bot to Discord.\n- **Heartbeating**: Periodically telling Discord the bot is still alive.\n- **Resuming**: Automatically reconnecting if the connection drops.\n\n## Async/Await\n\nSWDCK is built from the ground up using modern Swift concurrency. Almost every method that interacts with Discord is `async` and capable of `throwing` errors. This ensures your bot remains responsive and handles network failures gracefully.\n\n```swift\n// Everything is async and thread-safe\ntry await bot.sendMessage(to: \"channel_id\", content: \"Hello!\")\n```\n\n## Event-Driven Architecture\n\nInstead of constantly asking Discord \"Is there a new message?\", your bot registers **Handlers** for specific events. When an event occurs, Discord sends it to SWDCK, which then executes your code.\n\n```swift\nbot.onMessage { message in \n    print(\"Received: \\(message.content)\")\n}\n```\n\n## Caching\n> 🚫 **Not supported:** SWDCK does not currently implement built-in caching for guilds, members, or channels. Every piece of data is provided directly from the Discord event or requested via the REST API.\n\n> **Next:** [Event System](./event-system)\n"
}